## Combining Data with Overlap

In [11]:
import pandas as pd
import numpy as np

In [12]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
    'b': [np.nan, 2., np.nan, 6.],   
    'c': range(2, 18, 4)})

## Reshaping with Hierarchical Indexing

In [14]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),   
                    .....:                     index=pd.Index(['Ohio', 'Colorado'], name='state'),   
                    .....:                     columns=pd.Index(['one', 'two', 'three'],   
                                                                .....:                     name='number'))

In [15]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [16]:
 result = data.stack()

In [17]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [19]:
result2 =result.unstack()

In [20]:
result2

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [21]:
result2.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [27]:
result.unstack(0) ## pas index 0 ## ther r two index Ohio ... and one.....

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [26]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [38]:
result ##its stack value

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [36]:
 df = pd.DataFrame({'left': result, 'right': result + 5},   
                   .....:                   columns=pd.Index(['left', 'right'], name='side'))

In [35]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [29]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [ ]:
##33https://resources.oreilly.com/examples/0636920023784/blob/master/pydata-book-master/ch07/macrodata.csv

In [55]:
data=pd.read_csv('macrodata.csv')

In [56]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [54]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,   
                         .....:                          name='date')

AttributeError: 'DataFrame' object has no attribute 'year'

In [44]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

## Pivoting “Wide” to “Long” Format

In [46]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],   
                   .....:                    'A': [1, 2, 3],   
                   .....:                    'B': [4, 5, 6],   
                   .....:                    'C': [7, 8, 9]})

In [47]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [49]:
melted = pd.melt(df, ['key'])
melted ## it make the coulme index  to rows

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [51]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7